test_cases/turbulentFlatPlate/0.SpalartAllmaras/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

// 3*nu_inf <= nuTilda_inf <= 5*nu_inf. Here, 5*nu_inf is used.
internalField   uniform 6.94e-5;

boundaryField
{
    // freestream BC should be used at the inlet and outlet for the convergence of solutions
    inlet
    {
        type            freestream;
        freestreamValue $internalField;
    }

    outlet
    {
        type            freestream;
        freestreamValue $internalField;
    }

    topWall
    {
        type            fixedValue;
        value           $internalField;
    }

    // nuTilda_wall = 0, there is no wall function for nuTilda.
    bottomWall
    {
        type            fixedValue;
        value           uniform 0;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }

    processor
    {
    	type  processor;
    	value $internalField;
    }
}

// ************************************************************************* //